// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так - виведіть повідомлення 'Вірно' у alert().
//    Якщо ні - виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().
const input = prompt("Введіть число:");
const number = Number(input);
if (number === 10) {
  alert("Вірно");
} else {
  alert("Невірно");
}

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);
const min = Math.floor(Math.random() * (59 - 0) + 0);
let message = "";
if (min >= 0 && min <= 14) {
  message = `${min} входить в першу чверть`;
} else if (min >= 15 && min <= 29) {
  message = `${min} входить в другу чверть`;
} else if (min >= 30 && min <= 44) {
  message = `${min} входить в третю чверть`;
} else if (min >= 45 && min <= 59) {
  message = `${min} входить у четверту чверть`;
} else {
  message = `Помилка: ${min} поза межами 0-59`;
}

alert(message);

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.
